app/internal/infrastructure/testdata/ot_book_request_mock.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:tem="http://schemas.xmltravelgate.com/hub/2012/06"
	xmlns:ns="http://schemas.xmltravelgate.com/hub/2012/06" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <soapenv:Header>
      <wstxns1:Security xmlns:wstxns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wstxns1:UsernameToken wstxns2:Id="uuid-abaee110-6f1d-4f04-95a6-d2eb8050ba9f-1" xmlns:wstxns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wstxns1:Username>GUEXML#20497</wstxns1:Username>
            <wstxns1:Password>$GU32024.1nc0.XML$</wstxns1:Password>
         </wstxns1:UsernameToken>
      </wstxns1:Security>
   </soapenv:Header>
   <soapenv:Body>
      <tem:Reservation>
         <!--Optional:-->
         <tem:reservationRQ>
            <ns:timeoutMilliseconds>57000</ns:timeoutMilliseconds>
            <ns:version>1</ns:version>
            <ns:providerRQ>
               <ns:code>pruebaGuest</ns:code>
               <ns:id>222</ns:id>
               <ns:rqXML>
                  <ReservationRQ>
                     <onRequest>false</onRequest>
                     <timeoutMilliseconds>57000</timeoutMilliseconds>
                     <source>
                        <languageCode>ES</languageCode>
                     </source>
                     <filterAuditData>
                        <registerTransactions>false</registerTransactions>
                     </filterAuditData>
                     <Configuration>
                        <Parameters>
                           <Parameter key="maxHotels" value="200"/>
                           <Parameter key="maxRooms" value="20"/>
                           <Parameter key="rsXML" value="true"/>
                        </Parameters>
                     </Configuration>
                     <ClientLocator>ReservaTest</ClientLocator>
                     <!--OnRequest>false</OnRequest-->
                     <StartDate>16/06/2025</StartDate>
                     <EndDate>20/06/2025</EndDate>
                     <MealPlanCode>AD</MealPlanCode>
                     <HotelCode>9521</HotelCode>
                     <OptionType>Hotel</OptionType>
                     <Currency>EUR</Currency>
                     <Nationality>ES</Nationality>
                     <Markets>
                        <Market>ES</Market>
                     </Markets>
                     <DailyRatePlans>
                        <DailyRatePlan name="Tarifa Flexible" cod="NAC_INT"/>
                     </DailyRatePlans>
                     <Price currency="EUR" amount="880.00" binding="false" commission="0"/>
                     <Parameters>
                        <Parameter key="session" value="261D2D3365F346AA8CDB38511CEF2A10"/>
                        <Parameter key="option2" value="RlVFUlRFQEBTREl4TVVBa1FFRkVRQ1JBU0c5MFpXeEFKRUJOWlhKamFHRnVkRkJoZVVBa1FFQWtRRElqVTFaQUpFQlRWa0FrUUVoaFltbDBZV05wdzdOdUlFUnZZbXhsSUMwZ1NTQjNZWE1nYUdWeVpVQWtRREZBSkVCR1lXeHpaVUFrUURCQUpFQTRPREF1TURCQUpFQXdRQ1JBTUVBa1FFWmhiSE5sUUNSQVVtRjBaVkJzWVc1RGIyUmxNVUFxS2tCT1FVTmZTVTVVUUY5ZlFGSnZiMjFVZVhCbFEyOWtaVEZBS2lwQVUxWkFYMTlBVFdWaGJGQnNZVzVEYjJSbE1VQXFLa0JCUkVCZlgwQlFjbVZqYVc5R2FXNWhiRUFxS2tBNE9EQkFYMTlBUUNSQVFDUkFRQ1JBVGtGRFgwbE9WRUFrUUZSaGNtbG1ZU0JHYkdWNGFXSnNaUT09"/>
                     </Parameters>
                     <Rooms>
                         <Room id="2" roomCandidateRefId="1" code="DBL_IWH#STD" description="DOBLE I WAS HERE" nonRefundable="false" numberOfUnits="11">
                            <Price currency="EUR" amount="880.00" binding="false" commission="0"/>
                         </Room>
                     </Rooms>
                     <ResGuests>
                        <Guests>
                           <Guest roomCandidateId="1" paxId="1">
                              <GivenName>test</GivenName>
                              <SurName>test</SurName>
                           </Guest>
                           <Guest roomCandidateId="1" paxId="2">
                              <GivenName>test</GivenName>
                              <SurName>test</SurName>
                           </Guest>
                        </Guests>
                     </ResGuests>
				 <RoomCandidates>
					<RoomCandidate id="1">
						<Paxes>
							<Pax age="30" id="1"></Pax>
							<Pax age="30" id="1"></Pax>
						</Paxes>
					</RoomCandidate>
				</RoomCandidates>
                  </ReservationRQ>
               </ns:rqXML>
            </ns:providerRQ>
         </tem:reservationRQ>
      </tem:Reservation>
   </soapenv:Body>
</soapenv:Envelope>